app/controllers/api/follows_controller.rb

  def create
    follow = current_user.follows.new(followed_id: params[:followed_id])
       # TODO: don't need to set follower_id
    if follow.save
---
INSERT INTO "follows" ("followed_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["followed_id", 3], ["follower_id", 1], ["created_at", "2015-06-14 02:17:11.829034"], ["updated_at", "2015-06-14 02:17:11.829034"]]