app/controllers/api/posts_controller.rb

INSERT INTO "posts" ("image_url", "body", "id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["image_url", "www.imageurl.net/image234"], ["body", "my cat image"], ["id", 6], ["author_id", 6], ["created_at", "2015-06-11 17:20:50.660753"], ["updated_at", "2015-06-11 17:20:50.660753"]]
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    if @post.save

SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]
---
  def index
    @posts = current_user.followed_posts.includes(:likes, :likers, :user, comments: :author)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 27]]
UPDATE "posts" SET "image_url" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["image_url", "http://res.cloudinary.com/dvd7awvbl/image/upload/w_600/ns5agrpmthh4lcg4lgqu.jpg"], ["body", "blurry prison"], ["updated_at", "2015-06-12 23:59:02.487856"], ["id", 32]]
---
  def update
    post = Post.find(params[:id])
    # TODO: check that current_user owns the post (before_action)
    if post
      if post.update(post_params)