app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" WHERE (username ILIKE '%jamie%')
SELECT COUNT(*) FROM "users" WHERE (username ILIKE '%kin%')
---
  def search
    #vulnerable to SQL injection?
    @users = User.where('username ILIKE ?', "%#{params[:search]}%")
    if @users.count < 1